package hw_7.clientapp;

//Класс-запускалка - имеет метод main, где инициализирует объект библиотеки с книгами и работает с функционалом
//        объекта библиотеки - вызывает методы поиска книг по разным критериям и выводит их на печать.
//        Метод печати книги должен быть определен в этом же классе, как статический,
//        позволяющий выводить в консоль все поля переданного в метод объект книги.
//        Если в метод был передан пустой (null) объект - вместо книги в консоль должно выводиться предупреждение.
public class BuildLibrary {
}
